from repository import init_db
from querrys import run_a_querry

querrys_list = """
                1. Знайти 5 студентів із найбільшим середнім балом з усіх предметів.
                2. Знайти студента із найвищим середнім балом з певного предмета. Для прикладу використали предмет з ідентифікатором 1.
                3. Знайти середній бал у групах з певного предмета. Для прикладу використали предмет з ідентифікатором 1.
                4. Знайти середній бал на потоці (по всій таблиці оцінок).
                5. Знайти, які курси читає певний викладач. Для прикладу використали викладача з ідентифікатором 1.
                6. Знайти список студентів у певній групі. Для прикладу використали группу з ідентифікатором 1.
                7. Знайти оцінки студентів в окремій групі з певного предмета. Для прикладу використали предмет та группу з ідентифікаторами 1.
                8. Знайти середній бал, який ставить певний викладач зі своїх предметів. Для прикладу використали викладача з ідентифікатором 1.
                9. Знайти список курсів, які відвідує студент. Для прикладу використали студента з ідентифікатором 1.
                10. Список курсів, які певному студенту читає певний викладач. Для прикладу використали студента та викладача з ідентифікаторами 1.
                """


def main():
    init_db()
    print("База создана/загружена")
    running = True
    while running:
        print('Выберите номер запроса или напишите exit для выхода')
        print(querrys_list)
        command = input('Введите команду..')
        if command == 'exit':
            running = False
        elif command in ['1','2','3','4','5','6','7','8','9','10']:
            run_a_querry(command)
        else:
            print('Enter a number 1-10 or exit')



if __name__ == '__main__':
    main()

